In [1]:
import numpy as np
import pandas as pd

In [2]:
# Creating a DataFrame

In [3]:
data = {
    'name': ['John', 'Anna', 'Don'],
    'age': [22,32,27],
    'city': ['Vrindavan', 'Mathura', 'Kolkata'],
    'salary': [3400,5400,2400]
}
df = pd.DataFrame(data)

In [4]:
df

   name  age       city  salary
0  John   22  Vrindavan    3400
1  Anna   32    Mathura    5400
2   Don   27    Kolkata    2400

In [5]:
data_list = [
    ['John', 'Anna', 'Don'],
    [22,32,27],
    ['Vrindavan', 'Mathura', 'Kolkata'],
    [3400,5400,2400]
]
df2 = pd.DataFrame(data_list)

In [6]:
df2

           0        1        2
0       John     Anna      Don
1         22       32       27
2  Vrindavan  Mathura  Kolkata
3       3400     5400     2400

In [7]:
data_list = [
    ['John', 28, 'New York', 6400],
    ['Anna', 34, 'Paris', 3300],
    ['Pater', 32, 'Berlin', 5200],
    ['Linda', 27, 'London', 7300]
]
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list,columns = columns)
df2

    Name  Age      City  Salary
0   John   28  New York    6400
1   Anna   34     Paris    3300
2  Pater   32    Berlin    5200
3  Linda   27    London    7300

In [8]:
# Selecting and Indexing of Columns

In [9]:
df2

    Name  Age      City  Salary
0   John   28  New York    6400
1   Anna   34     Paris    3300
2  Pater   32    Berlin    5200
3  Linda   27    London    7300

In [10]:
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [11]:
df2[['Name','City','Age']]

    Name      City  Age
0   John  New York   28
1   Anna     Paris   34
2  Pater    Berlin   32
3  Linda    London   27

In [12]:
# Creating a New Column

In [13]:
df2['Designation'] = ['Ai Engineer', 'Doctor', 'Lawyer', 'Pilot']

In [14]:
df2

    Name  Age      City  Salary  Designation
0   John   28  New York    6400  Ai Engineer
1   Anna   34     Paris    3300       Doctor
2  Pater   32    Berlin    5200       Lawyer
3  Linda   27    London    7300        Pilot

In [15]:
# Deleting Column

In [16]:
df2.drop('City', axis = 1)     # Deletes only from here

    Name  Age  Salary  Designation
0   John   28    6400  Ai Engineer
1   Anna   34    3300       Doctor
2  Pater   32    5200       Lawyer
3  Linda   27    7300        Pilot

In [17]:
df2

    Name  Age      City  Salary  Designation
0   John   28  New York    6400  Ai Engineer
1   Anna   34     Paris    3300       Doctor
2  Pater   32    Berlin    5200       Lawyer
3  Linda   27    London    7300        Pilot

In [18]:
df2.drop(['City','Salary'], axis = 1)     # Deletes permanently(inplace = True)

    Name  Age  Designation
0   John   28  Ai Engineer
1   Anna   34       Doctor
2  Pater   32       Lawyer
3  Linda   27        Pilot

In [19]:
df2

    Name  Age      City  Salary  Designation
0   John   28  New York    6400  Ai Engineer
1   Anna   34     Paris    3300       Doctor
2  Pater   32    Berlin    5200       Lawyer
3  Linda   27    London    7300        Pilot

In [20]:
# Deleting Rows

In [21]:
df2.drop([0,1],axis = 0)

    Name  Age    City  Salary Designation
2  Pater   32  Berlin    5200      Lawyer
3  Linda   27  London    7300       Pilot

In [ ]:
# Selecting Rows

In [22]:
df2

    Name  Age      City  Salary  Designation
0   John   28  New York    6400  Ai Engineer
1   Anna   34     Paris    3300       Doctor
2  Pater   32    Berlin    5200       Lawyer
3  Linda   27    London    7300        Pilot

In [26]:
df2.loc[[1,3]]

    Name  Age    City  Salary Designation
1   Anna   34   Paris    3300      Doctor
3  Linda   27  London    7300       Pilot

In [29]:
# Selecting subsets of rows and columns

In [30]:
df2.loc[[1,2]][['Salary','City']]

   Salary    City
1    3300   Paris
2    5200  Berlin

In [31]:
# Condition Selection

In [32]:
df2

    Name  Age      City  Salary  Designation
0   John   28  New York    6400  Ai Engineer
1   Anna   34     Paris    3300       Doctor
2  Pater   32    Berlin    5200       Lawyer
3  Linda   27    London    7300        Pilot

In [33]:
df2[df2['Age'] > 30]

    Name  Age    City  Salary Designation
1   Anna   34   Paris    3300      Doctor
2  Pater   32  Berlin    5200      Lawyer

In [35]:
df2[(df2['Age'] > 30) & (df2['City'] == 'Paris')]

   Name  Age   City  Salary Designation
1  Anna   34  Paris    3300      Doctor